Repository: mihkelp1/hk-wp-mall
Catalog: trunk/languages/*.po
Languages: et

source: This is somewhat embarrassing, isn&rsquo;t it?
et: Lehekülge ei leitud

source: It seems we can&rsquo;t find what you&rsquo;re looking for. Perhaps searching, or one of the links, can help.
et: Otsitud lehekülge ei leitud. Ehk on abi viidetest all pool või otsingust.

source: Recent news
et: Hiljutised uudised

source: Tags
et: Sildid

source: Nothing Found
et: Midagi ei leitud

source: Apologies, but no results were found for the requested archive. Perhaps searching will help find a related post.
et: Valitud arhiivis ei leitud postitusi. Proovige otsingut.

source: TLU Haapsalu College
et: TLÜ Haapsalu Kolledž

source: Edit
et: Muuda

source: Tags: %1$s
et: Sildid: %1$s

source: News
et: Uudised

source: Header menu
et: Päise menüü

source: Navigation menu
et: Navigatsioon

source: Footer left
et: Jalus vasak

source: Footer middle
et: Jalus keskel

source: Footer right
et: Jalus paremal

source: General menu
et: Üldmenüü

source: Footer sidebar
et: Jaluse külgpaan

source: Widgets in this area will be shown in the footer.
et: Moodulid selles alas kuvatakse lehe jaluses.

source: Your email
et: E-posti aadress

source: Subscribe
et: Liitu

source: Intrested in this curriculum ?
et: Soovid õppida valitud erialal ?

source: SUBSCRIBE
et: LIITU INFOLISTIGA

source: click here
et: vajuta siia

source: Reminders
et: Meelespead

source: Subscribed
et: Tellinud

source: Send reminder
et: Saada teavitus

source: History
et: Ajalugu

source: Reminders settings
et: Meelespea seaded

source: Settings
et: Seaded

source: Enable reminders
et: Luba meelespead

source: Modal welcome text
et: Hüpikakna sisu

source: Subject
et: Pealkiri

source: Body
et: Sisu

source: Footer
et: Jalus

source: Enable or disable reminders functionality.
et: Luba meelespeade funktsioon

source: Subscribe popup
et: Hüpikaken

source: Confirmation email
et: Kinnituskiri

source: Unsubscribe email
et: Meelespea nimekirjast eemaldatud

source: E-mail general
et: Üldine

source: Enter welcome text here to be displayed in the subscribe to list modal popup.
et: Sisesta siia meelespea hüpikakna sisu.

source: Enter confirmation email subject here to be sent out to subscribed user.
et: Sisesta siia meelespea kinnituskirja pealkiri.

source: Enter unsubscribe email body here to be sent out to unsubscribed user.
et: Sisesta siia meelespea nimekirjast eemdaldatud kinnituskirja pealkiri.

source: Enter unsubscribe email subject here to be sent out to unsubscribed user.
et: Sisesta siia meelespea nimekirjast eemaldatud kinnituskirja sisu.

source: Enter confirmation email body here to be sent out to subscribed user. <strong>{unsubscribe_link}</strong> will be replaced with unsubscribe link titled <strong>"click here"</strong>.
et: Sisesta siia meelespea kinnitusekirja sisu. <strong>{unsubscribe_link}</strong> asendatakse lingiga <strong>"vajuta siia"</strong>.

source: Enter email footer content here.
et: Sisesta siia e-kirja jaluse sisu.

source: Save
et: Salvesta

source: Reminder email sent
et: Infokiri saadetud

source: E-mail will be sent to <strong>%s subscribers</strong>
et: E-kiri saadetakse <strong>%s tellinule</strong>

source: Last e-mail was sent on
et: Viimane teavitus saadeti

source: Message
et: Sisu

source: Dear ... You would like you inform... Do unsubcribe from the list {unsubscribe_link}
et: Lugupeetud ... Soovime teavitada... Infolistist eemaldumiseks vajutage {unsubscribe_link}

source: Available shortcodes: <strong>{unsubscribe_link}</strong> - will be replaced with unsubcribe link titled <strong>"click here"</strong>.
et: Saadaolevad lühikoodid: <strong>{unsubscribe_link}</strong> asendatakse listist eemaldamise lingiga <strong>"vajuta siia"</strong>.

source: <strong>Footer</strong> is added to the outgoing message <strong>automatically.</strong>
et: <strong>Jalus</strong> lisatakse kirjale <strong>automaatselt.</strong>

source: Send
et: Saada

source: Number of people
et: Mitmele

source: Date
et: Kuupäev

source: Remindees
et: Tellijad

source: Email
et: E-post

source: Flag
et: Lipp

source: Delete
et: Kustuta

source: No subscriptions.
et: Ühtegi tellimust.

source: You have been unsubcribed from the mailing list
et: Olete meelespea nimekirjast eemaldatud

source: Close
et: Sulge

source: You have successfully subscribed
et: Oled edukalt infolistiga liitunud

source: You have already subscribed
et: Oled juba infolistiga liitunud

source: Your email is not valid
et: E-posti aadress on vigane

source: Trying to hack ?
et: Pikad näpud ?

source: Something went wrong, try again
et: Süsteemiviga, proovige uuesti

source: Are you sure?
et: Kas oled kindel ?

source: Pick a landing page image
et: Vali maandumislehe pilt

source: Read more
et: Loe kõiki uudiseid

source: Landing page
et: Maandumisleht

source: Add to landing page
et: Lisa maandumislehele

source: Youtube URL
et: Youtube aadress

source: Pick a landing page menu
et: Vali maandumislehe menüü

source: Disabled
et: Keelatud

source: Pick landing page image
et: Lisa pilt

source: Remove landing page image
et: Eemalda pilt

source: Listen to what others are saying.
et: Kuula, mida vilistlased arvavad.

source: WATCH CLIP
et: VAATA KLIPPI

source: Search Results for: %s
et: Otsingu tulemused: %s

source: Sorry, but nothing matched your search criteria. Please try again with some different keywords.
et: Sisestatud otsingule ei leitud ühtegi vastet. Proovige uuesti.

source: Search
et: Otsi
