Repository: mihkelp1/hk-wp-mall
Catalog: branches/news-footer-right/tags/0.7-landing-menu-bottom/languages/jquery-lightbox/jqlb-*.po
Languages: et

source: Settings
et: Seaded

source: previous image
et: eelmine

source: next image
et: järgmine

source: &laquo; Previous
et: &laquo; Eelmine

source: Next &raquo;
et: Järgmine &raquo;

source: close image gallery
et: sulge

source: Image
et: Pilt

source: Download
et: Lae alla

source: Cheatin&#8217; uh?
et: Pikad näpud?

source: Let the plugin add necessary html to image links
et: Lisa vajalik html kood pildi linkimiseks

source: Auto-lightbox image links
et: Lisa lightbox piltidele postituses

source: Note: this will disable the nofollow-attribute of comment links, that otherwise interfere with the lightbox.
et: Märkus: valides selle, keelab see nofollow atribuudi kommentaari linkides, mis muidu segavad lightboxi tööd

source: Enable lightbox in comments (disables <a href="http://codex.wordpress.org/Nofollow">the nofollow attribute!</a>)
et: Luba lightbox kommentaarides (keelab <a href="http://codex.wordpress.org/Nofollow">nofollow atribuudi!</a>)

source: Show download link
et: Kuva allalaadimise link

source: Target for download link:
et: Target väärtus allalaadimisel

source: Show image info on top
et: Kuva pildi infot päises

source: Shrink large images to fit smaller screens
et: Vähenda pilti väiksemate ekraanide jaoks

source: Keep a distance between the image and the screen edges.
et: Hoia distantsi pildi ja akna servade vahel

source: Minimum margin to screen edge (default: 0)
et: Minimaalne ääris akna servast (vaikimisi: 0)

source: Animation duration (in milliseconds)
et: Animatsiooni kiirus (millisekundites)

source: Help text (default: none)
et: Abi tekst (vaikimisi: tühi)

source: Browse images with your keyboard: Arrows or P(revious)/N(ext) and X/C/ESC for close.
et: Piltide sirvimine klahvidega: Nooleklahvid / P(eelmine) / N (järgmine) ja X/C/ESC sulgemine

source: Save Changes
et: Salvesta muudatused
